<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"da5e9d0d3a354db255961e497504626871c6f52a4b206abe1055fe37c3cd37fe","plan_job_ref":"Job terraform plan #188 at https://github.com/suzutan/infra/actions/runs/20621228777","plan_out_hash":"613ed285ab3b6e68224995b2cef7d5c054983059c7967124ac5353bcca1a3309","plan_hash":"1b80044b472e6b401b1d960531cbf0e901459a1cf147409476172fa924c1dd36","plan_text_format":"diff","version":"2.2.2","closed":true} -->
Terraform plan in __terraform/suzutan.jp__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudflare_dns_record.blog will be created
+   resource "cloudflare_dns_record" "blog" {
+       content          = "4f5b0a82a8e167b1.vercel-dns-017.com."
+       created_on       = (known after apply)
+       id               = (known after apply)
+       meta             = (known after apply)
+       modified_on      = (known after apply)
+       name             = "blog"
+       proxiable        = (known after apply)
+       proxied          = false
+       settings         = (known after apply)
+       tags             = (known after apply)
+       tags_modified_on = (known after apply)
+       ttl              = 300
+       type             = "CNAME"
+       zone_id          = "********************************"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [terraform apply #152](https://github.com/suzutan/infra/actions/runs/20621244307)